alibaba/AliOS-Things/platform/mcu/atsaml21/saml21b/svd/ATSAML21G17B.svd
        <register>
          <name>DFLLMUL</name>
          <description>DFLL48M Multiplier</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MUL</name>
              <description>DFLL Multiply Factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>FSTEP</name>
              <description>Fine Maximum Step</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CSTEP</name>
              <description>Coarse Maximum Step</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLLSYNC</name>
          <description>DFLL48M Synchronization</description>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>READREQ</name>
              <description>Read Request</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLLCTRLA</name>
          <description>DPLL Control</description>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONDEMAND</name>
              <description>On Demand</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLLRATIO</name>
          <description>DPLL Ratio Control</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LDR</name>
              <description>Loop Divider Ratio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>LDRFRAC</name>
              <description>Loop Divider Ratio Fractional Part</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLLCTRLB</name>
          <description>Digital Core Configuration</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FILTER</name>
              <description>Proportional Integral Filter Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LPEN</name>
              <description>Low-Power Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUF</name>
              <description>Wake Up Fast</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REFCLK</name>
              <description>Reference Clock Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LTIME</name>
              <description>Lock Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LBYPASS</name>
              <description>Lock Bypass</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIV</name>
              <description>Clock Divider</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLLPRESC</name>
          <description>DPLL Prescaler</description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PRESC</name>
              <description>Output Clock Prescaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>PRESCSelect</name>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>DPLL output is divided by 1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>DPLL output is divided by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>DPLL output is divided by 4</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLLSYNCBUSY</name>
          <description>DPLL Synchronization Busy</description>
          <addressOffset>0x38</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>DPLL Enable Synchronization Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPLLRATIO</name>
              <description>DPLL Ratio Synchronization Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPLLPRESC</name>
              <description>DPLL Prescaler Synchronization Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLLSTATUS</name>
          <description>DPLL Status</description>
          <addressOffset>0x3C</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LOCK</name>
              <description>DPLL Lock Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLKRDY</name>
              <description>DPLL Clock Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
